# CannotCreateBalusterPatterns Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..CannotCreateBalusterPatterns Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Can't create Baluster Patterns for Railings
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateBalusterPatterns { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateBalusterPatterns As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateBalusterPatterns {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace